stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  // Steering settings
  doc["kp"] = espData.steer.gainP;
  doc["highPWM"] = espData.steer.highPWM;
  doc["lowPWM"] = espData.steer.lowPWM;
  doc["minPWM"] = espData.steer.minPWM;
  doc["countsPerDeg"] = espData.steer.countsPerDeg;
  doc["wasOffset"] = espData.steer.steerOffset;
  doc["pidInputFilt"] = espData.steer.pidInputFilt;
  doc["pidOutputFilt"] = espData.steer.pidOutputFilt;
  doc["useADS"] = espData.steer.useADS;
  
  // System settings
  doc["gpsSource"] = espData.gps.externalGPS ? 1 : 0;
  doc["wasSource"] = espData.steer.wirelessWAS ? 1 : 0;
  doc["ledBrightness"] = espData.program.ledBrht;
  doc["adsAddress"] = "0x48"; // Default, could be made configurable
  
  String response;
  serializeJson(doc, response);
  
  Serial.println("Settings JSON prepared:");
  Serial.println("  Network: " + String(espData.wifi.ips[0]) + "." + String(espData.wifi.ips[1]) + "." + String(espData.wifi.ips[2]) + "." + String(espData.wifi.ips[3]));
  Serial.println("  Kp: " + String(espData.steer.gainP));
  Serial.println("  High PWM: " + String(espData.steer.highPWM));
  Serial.println("  Low PWM: " + String(espData.steer.lowPWM));
  Serial.println("  Min PWM: " + String(espData.steer.minPWM));
  Serial.println("  Use ADS: " + String(espData.steer.useADS ? "true" : "false"));
  Serial.println("JSON Response size: " + String(response.length()) + " bytes");
  
  request->send(200, "application/json", response);
  Serial.println("Settings JSON sent successfully");
}

// Save settings from JSON POST
void handleSaveSettings(AsyncWebServerRequest *request) {
  Serial.println("=== SAVE SETTINGS REQUEST ===");
  Serial.println("Client IP: " + request->client()->remoteIP().toString());
  Serial.println("Request Method: " + String(request->methodToString()));
  Serial.println("Number of parameters: " + String(request->params()));
  
  // Log all received parameters
  for (int i = 0; i < request->params(); i++) {
    const AsyncWebParameter* p = request->getParam(i);
    Serial.println("Parameter [" + String(i) + "]: " + p->name() + " = " + p->value());
  }
  
  // This will be called when the request has parameters
  // We'll use a simpler approach with URL parameters for now
  
  Serial.println("Processing network settings...");
  // Update network settings if provided
  if (request->hasParam("ip0", true)) {
    int oldValue = espData.wifi.ips[0];
    espData.wifi.ips[0] = request->getParam("ip0", true)->value().toInt();
    Serial.println("  IP0: " + String(oldValue) + " -> " + String(espData.wifi.ips[0]));
  }
  if (request->hasParam("ip1", true)) {
    int oldValue = espData.wifi.ips[1];
    espData.wifi.ips[1] = request->getParam("ip1", true)->value().toInt();
    Serial.println("  IP1: " + String(oldValue) + " -> " + String(espData.wifi.ips[1]));
  }
  if (request->hasParam("ip2", true)) {
    int oldValue = espData.wifi.ips[2];
    espData.wifi.ips[2] = request->getParam("ip2", true)->value().toInt();
    Serial.println("  IP2: " + String(oldValue) + " -> " + String(espData.wifi.ips[2]));
  }
  if (request->hasParam("ip3", true)) {
    int oldValue = espData.wifi.ips[3];
    espData.wifi.ips[3] = request->getParam("ip3", true)->value().toInt();
    Serial.println("  IP3: " + String(oldValue) + " -> " + String(espData.wifi.ips[3]));
  }
  
  Serial.println("Processing steering settings...");
  // Update steering settings if provided
  if (request->hasParam("kp", true)) {
    float oldValue = espData.steer.gainP;
    espData.steer.gainP = request->getParam("kp", true)->value().toFloat();
    Serial.println("  Kp: " + String(oldValue) + " -> " + String(espData.steer.gainP));
  }
  if (request->hasParam("highPWM", true)) {
    int oldValue = espData.steer.highPWM;
    espData.steer.highPWM = request->getParam("highPWM", true)->value().toInt();
    Serial.println("  High PWM: " + String(oldValue) + " -> " + String(espData.steer.highPWM));
  }
  if (request->hasParam("lowPWM", true)) {
    int oldValue = espData.steer.lowPWM;
    espData.steer.lowPWM = request->getParam("lowPWM", true)->value().toInt();
    Serial.println("  Low PWM: " + String(oldValue) + " -> " + String(espData.steer.lowPWM));
  }
  if (request->hasParam("minPWM", true)) {
    int oldValue = espData.steer.minPWM;
    espData.steer.minPWM = request->getParam("minPWM", true)->value().toInt();
    Serial.println("  Min PWM: " + String(oldValue) + " -> " + String(espData.steer.minPWM));
  }
  if (request->hasParam("countsPerDeg", true)) {
    float oldValue = espData.steer.countsPerDeg;
    espData.steer.countsPerDeg = request->getParam("countsPerDeg", true)->value().toFloat();
    Serial.println("  Counts Per Deg: " + String(oldValue) + " -> " + String(espData.steer.countsPerDeg));
  }
  if (request->hasParam("wasOffset", true)) {
    int oldValue = espData.steer.steerOffset;
    espData.steer.steerOffset = request->getParam("wasOffset", true)->value().toInt();
    Serial.println("  WAS Offset: " + String(oldValue) + " -> " + String(espData.steer.steerOffset));
  }
  if (request->hasParam("pidInputFilt", true)) {
    float oldValue = espData.steer.pidInputFilt;
    espData.steer.pidInputFilt = request->getParam("pidInputFilt", true)->value().toFloat();
    Serial.println("  PID Input Filter: " + String(oldValue) + " -> " + String(espData.steer.pidInputFilt));
  }
  if (request->hasParam("pidOutputFilt", true)) {
    float oldValue = espData.steer.pidOutputFilt;
    espData.steer.pidOutputFilt = request->getParam("pidOutputFilt", true)->value().toFloat();
    Serial.println("  PID Output Filter: " + String(oldValue) + " -> " + String(espData.steer.pidOutputFilt));
  }
  if (request->hasParam("useADS", true)) {
    bool oldValue = espData.steer.useADS;
    String rawValue = request->getParam("useADS", true)->value();
    espData.steer.useADS = rawValue.toInt();
    Serial.println("  Use ADS raw value: '" + rawValue + "'");
    Serial.println("  Use ADS: " + String(oldValue ? "true" : "false") + " -> " + String(espData.steer.useADS ? "true" : "false"));
  }
  
  Serial.println("Processing system settings...");
  // Update system settings if provided
  if (request->hasParam("gpsSource", true)) {
    bool oldValue = espData.gps.externalGPS;
    espData.gps.externalGPS = request->getParam("gpsSource", true)->value().toInt();
    Serial.println("  GPS Source: " + String(oldValue ? "Wireless" : "On-board") + " -> " + String(espData.gps.externalGPS ? "Wireless" : "On-board"));
  }
  if (request->hasParam("wasSource", true)) {
    bool oldValue = espData.steer.wirelessWAS;
    espData.steer.wirelessWAS = request->getParam("wasSource", true)->value().toInt();
    Serial.println("  WAS Source: " + String(oldValue ? "Wireless" : "Wired") + " -> " + String(espData.steer.wirelessWAS ? "Wireless" : "Wired"));
  }
  if (request->hasParam("ledBrightness", true)) {
    int oldValue = espData.program.ledBrht;
    espData.program.ledBrht = request->getParam("ledBrightness", true)->value().toInt();
    Serial.println("  LED Brightness: " + String(oldValue) + " -> " + String(espData.program.ledBrht));
    // Apply the new brightness immediately
    myLED.updateBrightness();
    Serial.println("  LED brightness updated immediately");
  }
  
  Serial.println("Attempting to save configuration to NVS...");
  // Save to preferences
  bool saveResult = espData.saveConfig();
  
  if (saveResult) {
    Serial.println("Configuration saved successfully to NVS");
    request->send(200, "text/plain", "Settings saved successfully! Some changes may require a reboot.");
  } else {
    Serial.println("ERROR: Failed to save configuration to NVS");
    request->send(500, "text/plain", "Failed to save settings to memory");
  }
  Serial.println("=== SAVE SETTINGS COMPLETE ===");
}

// File download handler
// void handleFileDownload(AsyncWebServerRequest *request) {
//   if (request->hasParam("filename")) {
//     String filename = request->getParam("filename")->value();
//     if (LittleFS.exists("/" + filename)) {
//       request->send(LittleFS, "/" + filename, "application/octet-stream");
//     } else {
//       request->send(404, "text/plain", "File not found");
//     }
//   } else {
//     request->send(400, "text/plain", "Filename not provided");
//   }
// }

