stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
        server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {}, 
        handleFirmwareUpload);

        server.on("/reboot", HTTP_GET, handleReboot);
        
        server.on("/toggleAPMode", HTTP_POST, handleToggleAPMode); // Add this line
        // Handle toggle state update
        server.on("/zeroWAS", HTTP_GET, handleWASzero);
        // Start server
        server.on("/Module_Disconnected", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("Sending Module_Disconnected.svg");
          request->send(LittleFS, "/Module_Disconnected.svg", "image/svg+xml");
        });
        server.on("/Module_Connected", HTTP_GET, [](AsyncWebServerRequest *request){
          request->send(LittleFS, "/Module_Connected.svg", "image/svg+xml");
        });
        server.on("/setGpsSource", HTTP_POST, [](AsyncWebServerRequest *request){},
        NULL,
        [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
            JsonDocument doc;
            DeserializationError error = deserializeJson(doc, data, len);
            if (error) {
                request->send(400, "text/plain", "Invalid JSON");
                return;
            }
            String source = doc["source"] | "";
            if (source == "um982") {

                espData.gps.externalGPS = false;
                request->send(200, "text/plain", "UM982 GPS selected");
            } else if (source == "external") {
                espData.gps.externalGPS = true;
                request->send(200, "text/plain", "External GPS selected");
            } else {
                request->send(400, "text/plain", "Unknown GPS source");
            }
        }
    );
        // server.on("/isConnected", HTTP_GET, [](AsyncWebServerRequest *request){
        //   request->send(LittleFS, "/Modu.svg", "image/svg+xml");
        // });
        server.begin();
      #pragma endregion
  
  mainPower.startTask();
  gps.init(&espUdp);
  espSteer.begin(&espUdp);
  

  // UDP setup
  espUdp.begin(&gps);
  Serial.println("Network setup complete");
  // delay(5000);
  espData.setState(1);
  espData.setBootCount(0);
  // Add your normal boot logic here
}

void setup(){
  Serial.begin(115200);
  myLED.startTask();
  // myLED.setLEDState(LEDState::NO_ERROR);
  delay(1000); // Give time for serial to initialize
  Serial.println("\n\nStarting up...");
  
  espData.program.confRes = espData.loadConfig();
  // Update LED brightness from loaded configuration
  myLED.updateBrightness();
  Serial.println("LED brightness set to: " + String(espData.program.ledBrht));
  
  if (espData.program.state != 1 && espData.program.bootcount > 2){
    Serial.println(" Booting into Recovery Mode");
    myLED.setLEDState(LEDState::RECOVERY_MODE);
    recoveryBoot();
  } else {
    normalboot();
  }
  
  // Serial command interface ready
  Serial.println("\n=== Serial Command Interface Ready ===");
  Serial.println("Type 'help' for available commands");
  Serial.print("> ");
  
  // Start Wifi AP and Webserver for diagnostics
  // espConfig.wifiCfg.state = espWifi.connect();

}

// Function to handle runtime serial commands
void handleSerialCommands() {
  static String inputBuffer = "";
  
  while (Serial.available()) {
    char c = Serial.read();
    
    if (c == '\n' || c == '\r') {
      if (inputBuffer.length() > 0) {
        inputBuffer.trim();
        inputBuffer.toLowerCase();
        
        Serial.println(""); // New line after command
        
        if (inputBuffer == "help" || inputBuffer == "?") {
          Serial.println("=== Available Serial Commands ===");
          Serial.println("help or ?         - Show this help");
          Serial.println("reboot            - Restart ESP32");
          Serial.println("recovery          - Reboot into recovery mode");
          Serial.println("normal            - Reboot into normal mode");
          Serial.println("status            - Show system status");
          Serial.println("config            - Show configuration");
          Serial.println("====================================");
          
        } else if (inputBuffer == "reboot") {
          Serial.println("SERIAL COMMAND: Rebooting ESP32...");
          delay(100);
          ESP.restart();
          
        } else if (inputBuffer == "recovery") {
          Serial.println("SERIAL COMMAND: Setting recovery mode and rebooting...");
          espData.program.state = 0; // Force recovery state
          espData.updateRTCBeforeReboot(0); // Update RTC before reboot
          espData.saveConfig();
          delay(100);
          ESP.restart();
          
        } else if (inputBuffer == "normal") {
          Serial.println("SERIAL COMMAND: Setting normal mode and rebooting...");
          espData.program.state = 1; // Force normal state
          espData.updateRTCBeforeReboot(1); // Update RTC before reboot
          espData.saveConfig();
          delay(100);
          ESP.restart();
          
        } else if (inputBuffer == "status") {
          Serial.println("=== System Status ===");
          Serial.println("Program: " + String(NAME));
          Serial.println("Boot Mode: " + String(espData.program.state == 1 ? "Normal" : "Recovery"));
          Serial.println("NVS Boot Count: " + String(espData.program.bootcount));
          Serial.println("Software Boots (since power cycle): " + String(espData.getSoftwareBootCount()));
          Serial.println("Uptime: " + String(millis()/1000) + " seconds");
          Serial.println("Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
          Serial.println("WiFi State: " + String(espData.wifi.state));
          Serial.println("GPS Fix: " + String(espData.gps.fixQuality));
          Serial.println("====================");
          
        } else if (inputBuffer == "config") {
          Serial.println("=== Configuration ===");
          Serial.println("IP: " + String(espData.wifi.ips[0]) + "." + String(espData.wifi.ips[1]) + "." + String(espData.wifi.ips[2]) + "." + String(espData.wifi.ips[3]));
          Serial.println("GPS Source: " + String(espData.gps.externalGPS ? "Wireless" : "On-board"));
          Serial.println("WAS Source: " + String(espData.steer.wirelessWAS ? "Wireless" : "Wired"));
          Serial.println("Use ADS: " + String(espData.steer.useADS ? "Yes" : "No"));
          Serial.println("LED Brightness: " + String(espData.program.ledBrht));
          Serial.println("PID Kp: " + String(espData.steer.gainP));
          Serial.println("====================");
          
        } else if (inputBuffer.length() > 0) {
          Serial.println("Unknown command: " + inputBuffer);
          Serial.println("Type 'help' for available commands");
        }
        
        inputBuffer = "";
        Serial.print("> "); // Command prompt
      }
    } else if (c >= 32 && c <= 126) { // Printable characters only
      inputBuffer += c;
      Serial.print(c); // Echo character
    }
  }
}

void debugPrint(){
  Serial.print("Timestamp: ");
  Serial.println(millis());
  Serial.print("\tprogName: ");
  Serial.print(String(NAME));
  Serial.print("\tprogState: ");
  Serial.print(espData.program.state);
  Serial.print("\tconfRes: ");
  Serial.print(espData.program.confRes);
  Serial.print("\twifiRes: ");
  Serial.print(espData.wifi.state);
  Serial.print("\tgpsFix: ");
  Serial.print(espData.gps.fixQualityInt);
  Serial.print("\tip: ");
  Serial.print(espData.wifi.ips[0]);
  Serial.print(".");
  Serial.print(espData.wifi.ips[1]);
  Serial.print(".");
  Serial.print(espData.wifi.ips[2]);
  Serial.print(".");
  Serial.print(espData.wifi.ips[3]);
  Serial.println();

  
  // Serial.printf(" gpsAge: %lu", espConfig.gpsData.);
  
  // Serial.println(twoWire.requestFrom(0x22, 0x01));
  // Serial.printf("Mag x: %.2f mT, y: %.2f mT, z: %.2f mT, Temp: %.2f °C\n", espConfig.magData.x, espConfig.magData.y, espConfig.magData.z, (espConfig.magData.t*1.8)+32);
  // Serial.println();
  // Serial.println(espConfig.progCfg.name);
  // Serial.println();
}

void loop(){
  
  // Handle serial commands
  handleSerialCommands();
  
  debugPrint();
  
  delay(5000);
}